{"pageProps":{"category":{"category":"suiswap","categoryShow":"SUISWAP","content":[{"section":"suiswap","sectionShow":"Suiswap","articles":[{"time":"2023-04-24","name":"introduction-to-suiswap","nameShow":"÷ Introduction To Suiswap","description":"Suiswap is a decentralized token trading platform and exchange built on the SUI blockchain by Vivid Network. It aims to provide a secure, fast, and agile trading environment for the SUI ecosystem.","markdownPath":"/doc/articles/introduction-to-suiswap.md","cover":"/doc/cover/suiswap-doc-image-cover.jpg","thumbnailImage":"/doc/cover/suiswap-doc-image-cover.jpg"},{"time":"2023-05-08","name":"suiswap-tokenomics","nameShow":"路 Suiswap Tokenomics","description":"The SSWP token symbolizes the Suiswap protocol token, a native token within the SUI blockchain ecosystem. The purpose of the SSWP token is to strengthen the Suiswap protocol, platform, and governance mechanisms.","markdownPath":"/doc/articles/suiswap-tokenomics.md","cover":"/doc/cover/suiswap-tokenomics-cover.jpg","thumbnailImage":"/doc/cover/suiswap-tokenomics-cover.jpg"}]}]},"articlesContent":[{"article":{"time":"2023-04-24","name":"introduction-to-suiswap","nameShow":"÷ Introduction To Suiswap","description":"Suiswap is a decentralized token trading platform and exchange built on the SUI blockchain by Vivid Network. It aims to provide a secure, fast, and agile trading environment for the SUI ecosystem.","markdownPath":"/doc/articles/introduction-to-suiswap.md","cover":"/doc/cover/suiswap-doc-image-cover.jpg","thumbnailImage":"/doc/cover/suiswap-doc-image-cover.jpg"},"section":{"section":"suiswap","sectionShow":"Suiswap","articles":[{"time":"2023-04-24","name":"introduction-to-suiswap","nameShow":"÷ Introduction To Suiswap","description":"Suiswap is a decentralized token trading platform and exchange built on the SUI blockchain by Vivid Network. It aims to provide a secure, fast, and agile trading environment for the SUI ecosystem.","markdownPath":"/doc/articles/introduction-to-suiswap.md","cover":"/doc/cover/suiswap-doc-image-cover.jpg","thumbnailImage":"/doc/cover/suiswap-doc-image-cover.jpg"},{"time":"2023-05-08","name":"suiswap-tokenomics","nameShow":"路 Suiswap Tokenomics","description":"The SSWP token symbolizes the Suiswap protocol token, a native token within the SUI blockchain ecosystem. The purpose of the SSWP token is to strengthen the Suiswap protocol, platform, and governance mechanisms.","markdownPath":"/doc/articles/suiswap-tokenomics.md","cover":"/doc/cover/suiswap-tokenomics-cover.jpg","thumbnailImage":"/doc/cover/suiswap-tokenomics-cover.jpg"}]},"content":"## A Comprehensive Overview\n\n![suiswap-cover {width:100%} {height:300px}](/doc/images/introduction-to-suiswap-title.png)\n\nSuiswap is a decentralized token trading platform and exchange built on the SUI blockchain by Vivid Network. It aims to provide a secure, fast, and agile trading environment for the SUI ecosystem. In this article, we will provide an in-depth look at Suiswap, its key components, and the overall vision of the platform.\n\n## Background\n\nThe name Suiswap is derived from the combination of \"Sui\" (the name of the blockchain) and \"Swap\" (token trading). Taking advantage of the fast and secure nature of the SUI blockchain, Suiswap's primary goal is to offer a decentralized, rapid, and secure token trading platform for the SUI blockchain. Additionally, it aims to build a foundational infrastructure for token trading for other protocols built on top of SUI.\n\nSuiswap hopes to provide the entire SUI community with a decentralized, fast token exchange or order book-based trading platform. Specifically, Suiswap's main components will consist of the following:\n\n1. Decentralized token exchange built on traditional liquidity pools, similar to [Uniswap](https://uniswap.org/)'s SUI/USDC.\n2. Decentralized token exchange based on stablecoin liquidity pools, similar to [Curve](https://curve.fi/)'s USDC/USDT.\n3. Central limit order book trading platform.\n4. Decentralized aggregator built on the above three points, aggregating liquidity from order books and liquidity pools to provide greater liquidity and lower slippage.\n5. Liquidity farming to earn platform tokens (SSWP) by providing liquidity.\n6. Yield farming and platform revenue acquisition through staking platform tokens.\n\nThe vision is to provide a unified platform for trading (Trade) and exchanging (Swap) infrastructure for the entire SUI ecosystem and empower other platform protocols based on this foundation.\n\n## Key Components\n\n### 1. Traditional Liquidity Pools\n\nSimilar to [Uniswap](https://uniswap.org/), Suiswap will offer decentralized token exchange built on traditional liquidity pools. Users can trade tokens like SUI/USDC in a permissionless and decentralized manner. Liquidity providers (LPs) can contribute assets to the pool, earning a portion of the trading fees generated by the platform.\n\n### 2. Stablecoin Liquidity Pools\n\nSuiswap will also feature stablecoin liquidity pools, akin to [Curve](https://curve.fi/)'s USDC/USDT pools. These pools provide lower slippage and tighter spreads when trading stablecoins, making them an attractive option for traders and LPs alike.\n\n### 3. Central Limit Order Book Trading Platform\n\nTo cater to more sophisticated traders, Suiswap will include a central limit order book (CLOB) trading platform. This component allows users to place limit orders, offering more control over their trades and potentially better prices compared to automated market makers (AMMs).\n\n### 4. Decentralized Aggregator\n\nThe decentralized aggregator is a crucial component of Suiswap, combining liquidity from order books and liquidity pools to provide greater liquidity and lower slippage for traders. By aggregating multiple sources of liquidity, Suiswap aims to offer a more efficient and seamless trading experience.\n\n### 5. Liquidity Farming\n\nUsers who provide liquidity to Suiswap's pools will be able to participate in liquidity farming, earning SSWP tokens as a reward. This incentive mechanism aims to attract more users to the platform, increasing liquidity and improving the overall trading experience.\n\n### 6. Yield Farming and Platform Revenue\n\nStaking SSWP tokens will enable users to participate in yield farming and gain a share of the platform's revenue. This feature offers\n\nadditional incentives for users to hold and use SSWP tokens, further supporting the growth of the Suiswap ecosystem.\n\n## Vision and Future Development\n\nSuiswap aims to provide a unified trading and exchanging infrastructure for the entire SUI ecosystem by offering a comprehensive platform that caters to various user needs. By empowering other platform protocols built on the SUI blockchain, Suiswap strives to become the go-to solution for token trading within the SUI community.\n\nThe future development of Suiswap will focus on expanding the platform's offerings and continuously refining the user experience. Some potential areas of growth include:\n\n1. **Cross-chain integration**: Integrating with other blockchain networks will enable Suiswap to tap into a broader user base and facilitate cross-chain asset transfers, further solidifying its position as a leading trading platform.\n\n2. **New financial products**: Expanding Suiswap's product offerings to include more advanced financial instruments, such as options and derivatives, will cater to a wider range of traders and investors.\n\n3. **Enhanced user experience**: Continuously refining the platform's interface and functionality will ensure that users have a seamless and efficient trading experience.\n\n4. **Community governance**: Implementing a community governance model will enable Suiswap governance token holders to have a say in the future development and direction of the platform, promoting a more decentralized and community-driven ecosystem.\n\n5. **Partnerships and integrations**: Collaborating with other projects and platforms within the SUI ecosystem will strengthen the overall network and increase the utility of the Suiswap platform.\n\nSuiswap is a promising decentralized token trading platform and exchange built on the SUI blockchain. By offering a comprehensive suite of trading tools, including traditional liquidity pools, stablecoin liquidity pools, a central limit order book trading platform, and a decentralized aggregator, Suiswap aims to cater to a wide range of user needs.\n\nThe platform's focus on liquidity farming and yield farming offers attractive incentives for users to participate in and support the growth of the Suiswap ecosystem. With a clear vision and a robust foundation, Suiswap is well-positioned to become a leading trading platform within the SUI community and beyond.\n\n## Useful Link \n\n- [Discord](https://discord.gg/suiswap)\n- [Twitter](https://twitter.com/suiswap_app)\n- [Crew3 / Zealy](https://zealy.io/c/suiswap-app/questboard)"},{"article":{"time":"2023-05-08","name":"suiswap-tokenomics","nameShow":"路 Suiswap Tokenomics","description":"The SSWP token symbolizes the Suiswap protocol token, a native token within the SUI blockchain ecosystem. The purpose of the SSWP token is to strengthen the Suiswap protocol, platform, and governance mechanisms.","markdownPath":"/doc/articles/suiswap-tokenomics.md","cover":"/doc/cover/suiswap-tokenomics-cover.jpg","thumbnailImage":"/doc/cover/suiswap-tokenomics-cover.jpg"},"section":{"section":"suiswap","sectionShow":"Suiswap","articles":[{"time":"2023-04-24","name":"introduction-to-suiswap","nameShow":"÷ Introduction To Suiswap","description":"Suiswap is a decentralized token trading platform and exchange built on the SUI blockchain by Vivid Network. It aims to provide a secure, fast, and agile trading environment for the SUI ecosystem.","markdownPath":"/doc/articles/introduction-to-suiswap.md","cover":"/doc/cover/suiswap-doc-image-cover.jpg","thumbnailImage":"/doc/cover/suiswap-doc-image-cover.jpg"},{"time":"2023-05-08","name":"suiswap-tokenomics","nameShow":"路 Suiswap Tokenomics","description":"The SSWP token symbolizes the Suiswap protocol token, a native token within the SUI blockchain ecosystem. The purpose of the SSWP token is to strengthen the Suiswap protocol, platform, and governance mechanisms.","markdownPath":"/doc/articles/suiswap-tokenomics.md","cover":"/doc/cover/suiswap-tokenomics-cover.jpg","thumbnailImage":"/doc/cover/suiswap-tokenomics-cover.jpg"}]},"content":"> Whitepaper PDF: [Suiswap Tokenomics.pdf](/doc/misc/suiswap-tokenomics.pdf)\n\nThe SSWP token symbolizes the Suiswap protocol token, a native token within the SUI blockchain ecosystem. \nThe purpose of the SSWP token is to strengthen the Suiswap protocol, platform, and governance mechanisms. \nSuiswap aspires to establish itself as the premier trading platform for the entire SUI network, offering liquidity for various swaps and transactions. \nAs the governance token of Suiswap, the SSWP token constitutes an essential component of the platform's operation.\n\n1. **The Suiswap platform intends to enable community members to derive revenue rights through the SSWP token**: By holding and staking platform tokens on the platform, community members can obtain platform revenue generated from trading fees and other channels via SSWP tokens.\n\n2. **The Suiswap platform seeks to facilitate the distribution of platform management rights among community members holding SSWP tokens**: By staking tokens, members can contribute valuable insights and influence the future trajectory of the platform's development. \n\n## The Value of SSWP\n\nThe SSWP token is the core of all trading and management on the Suiswap platform, and SSWP holders can have the following rights:\n\n1. **Platform Revenue**: We will distribute approximately 60% of the platform revenue evenly among SSWP token holders. All you need to do is lock your SSWP on the Suiswap platform, and you can receive the corresponding platform revenue every 14 days without unlocking your tokens.\n\n2. **Platform Governance**: By staking your tokens through SUI blockchain-based smart contracts, you can govern the SUI platform and community.\n\n3. **Yield Farming**: By locking your SSWP on the Suiswap platform, you can earn additional SSWP rewards when you unlock your tokens.\n\n4. **Trading, Holding, and Circulation**: Like other tokens, unlocked SSWP tokens can be traded, held, and circulated on the blockchain.\n\n## SSWP Automatic Token Burn Mechanism\n\n**The Suiswap platform will automatically use a portion of its platform revenue to automatically buy back SSWP tokens from the market and permanently destroy them.**\n\nThis means that the number of SSWP tokens will gradually decrease over time. By progressively reducing market liquidity, we give SSWP tokens the incentive to continually increase in value, encouraging our users to hold SSWP tokens for the long term.\n\n## SSWP Specifications\n\n**The total supply of SSWP tokens is capped at 10 billion**, ensuring that the maximum number of tokens in circulation will never exceed this limit.\n\nThese tokens will be distributed among community members, early-stage investors, IDO participants, liquidity providers, the Suiswap team, and advisors according to various locking and vesting schemes delineated in a subsequent table and chart.\n\nThe protocol will generate the initial batch of SSWP tokens following the launch of the Suiswap mainnet through a series of token events:\n\n##### 1. Initial SSWP Liquidity Pool\n\nA small number of SSWP tokens will be allocated to the Suiswap `SSWP/SUI` liquidity trading pool immediately after the platform's mainnet launch. \n\nThis limited supply of SSWP tokens will primarily be used to determine token pricing during subsequent IDO events and to enable community members to engage with the ecosystem and features that rely on SSWP tokens (such as platform revenue acquisition and yield farming). \nThe `SSWP/SUI` pool will provide reference pricing for SSWP tokens in future IDO events.\n\n##### 2. Initial Liquidity Rewards Event\n\n**Suiswap will host a two-month initial liquidity rewards event after the mainnet launch to incentivize users to provide liquidity to the Suiswap protocol.**\nUsers can obtain Suiswap tokens by providing liquidity to pools such as `SUI/USDC`, `SUI/USDT`, and `USDC/USDT`, etc. \n\nThese SSWP tokens will be allocated to:\n- The first users to provide liquidity.\n- Weighted distribution according to the value of the liquidity provided.\n- Random participants distribution. These SSWP tokens will be randomly distributed to some participating community members who provides liquidity during the events.\n\n![suiswap-tokenomics-allocation {maxWidth:min(100%, 450px)} {caption:5375697377617020546f6b656e6f6d69637320416c6c6f636174696f6e}](/doc/images/suiswap-tokenomics-allocation.png)\n\n##### 3. IDO\n\nCommunity members can purchase SSWP tokens through the Suiswap token IDO event. \n**The IDO will be held approximately one month after the Suiswap mainnet launch.** \nMembers can buy SSWP tokens using the SUI token during the IDO event.\n\n##### 4. Airdrop\n\nThe airdrop event will be held after the IDO event concludes. \nSuiswap community members with OG roles or those who have accumulated Suiswap points will be eligible to receive the airdrop. \nWe will snapshots all member's Suiswap Points at the end of the IDO and distribute airdropped SSWP tokens proportionally based on the number of points. \nThe airdrop token amount is set to 2%~3.5% and will be dynamically adjusted based on the tokens left in the private sale.\n\n##### 5. Private Sale, Seed Round\n\nThese tokens will be given to early Suiswap investors. \nThe maximum token supply ratio for early investors is set to 13.5%. \nAll leftover tokens will be reallocated to the IDO, airdrop, and Suiswap partners.\n\n##### 6. Liquidity Mining\n\nAfter the \"Initial Liquidity Rewards Event\" we will implement long-term liquidity mining activities. \nA portion of SSWP will be allocated to corresponding trading pools daily. \nYou can earn SSWP rewards by providing consistent liquidity to these pools.\n\n##### 7. Yield Farming\n\nAfter the Suiswap mainnet launch, you can lock and stake Suiswap tokens on the Suiswap platform to earn a fixed APR return. \nYou will receive staking rewards once your tokens are unlocked.\n\n![suiswap-token-allocation-timeline {maxWidth:min(100%, 500px)} {caption:5353575020546f6b656e2043697263756c6174696f6e205363686564756c65}](/doc/images/suiswap-token-allocation-timeline.png)\n\n## Conclusion\n\nThe SSWP plays a crucial role in the Suiswap ecosystem, a decentralized exchange built on the innovative SUI blockchain. \nAs a governance token, SSWP enables its holders to participate in platform governance, enjoy platform revenue, and engage in yield farming and liquidity mining activities. \nWith a fixed supply of 10 billion SSWP tokens and a token burn mechanism, SSWP is designed to maintain a stable growth in value and incentivize long-term holding.\n\nThe Suiswap platform offers a variety of token events, such as the initial liquidity rewards event, IDO, airdrops, private sales, and seed rounds, to distribute SSWP tokens and encourage community engagement. \nBy actively participating in these events and providing liquidity to the platform, community members can benefit from the growth and success of the Suiswap ecosystem.\n\nAs SUI continues to develop and strengthen its blockchain technology, focusing on speed and security, Suiswap's potential as a leading decentralized exchange also increases. \nThe SSWP token will remain at the core of the Suiswap platform, empowering its users and shaping the future of decentralized finance."}]},"__N_SSG":true}